{
    "title": "Executive Assistant, Legal",
    "company": "Facebook",
    "department": "Legal, Finance, Facilities & Admin",
    "location": {
        "city": "Menlo Park",
        "state": "California",
        "country": "USA"
    },
    "description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities — we're just getting started. Facebook is seeking an experienced Executive Assistant to support a VP, Legal. The person in this role will need to be a masterful problem-solver and an organizational force given complex calendaring and heavy travel planning. Additionally, the ideal candidate will have exceptional communication skills, and will be resourceful in building relationships across the larger Facebook ecosystem.",
    "type": "full",
    "responsibilities": [
        "Manage hectic and complex calendars",
        "Coordinate internal and external meetings for multiple executives",
        "Prepare expense reports and purchase requisitions",
        "Coordinate both domestic and international travel arrangements",
        "Organize space planning and large offsite events",
        "General office duties as needed",
        "Build cross-functional relationships between departments"
    ],
    "minimum_requirements": [
        "6+ years of experience providing administrative support to 1 or more executives",
        "6+ years of experience coordinating travel logistics on behalf of 1 or more executives",
        "6+ years of calendar management and expense report management experience for 1 or more executives",
        "Experience prioritizing multiple projects",
        "Experience with Microsoft Office"
    ],
    "preferred_requirements": [
        "Bachelor's degree"
    ],
    "compensation": "",
    "duration": ""
}