{
    "title": "Front End Engineer",
    "company": "Facebook",
    "department": "Software Engineering",
    "location": {
        "city": "Seattle",
        "state": "Washington",
        "country": "USA"
    },
    "description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities — we're just getting started. Are you interested in building products used by more than a billion people? Do you like shipping code at a rapid pace? Facebook is seeking an experienced Front End Engineer that is passionate about building mobile and desktop web applications. This position is full-time and is based in our Seattle office.",
    "type": "full",
    "responsibilities": [
        "Implement the features and user interfaces of Facebook products like News Feed",
        "Architect efficient and reusable front-end systems that drive complex web applications",
        "Collaborate with Product Designers, Product Managers, and Software Engineers to deliver compelling user-facing products",
        "Identify and resolve performance and scalability issues"
    ],
    "minimum_requirements": [
        "3+ years of JavaScript experience, including concepts like asynchronous programming, closures, types, and ES6",
        "3+ years of HTML/CSS experience, including concepts like layout, specificity, cross browser compatibility, and accessibility",
        "3+ years experience with browser APIs and optimizing front end performance"
    ],
    "preferred_requirements": [
        "Experience with React",
        "BS/MS in Computer Science or a related technical field"
    ],
    "compensation": "",
    "duration": ""
}