{
    "title": "Senior Financial Analyst",
    "company": "Typeform",
    "department": "Finance",
    "location": {
        "city": "Barcelona",
        "state": "Catalonia",
        "country": "Spain"
    },
    "description": "At Typeform, our Finance department is key for company growth and development. We collaborate with the whole company in different matters on a daily basis and this, we think, makes us unique. At this point we are growing as a company and our team is just getting bigger.\nThat’s why we need you! We’re looking for a Senior Financial Analyst to join our amazing team of Financial Planning and Analysis.\nThe FP&A team is focused on three main pillars within Finance: supporting the organization in any finance related to projects and analytics, reporting and analysis of the performance of the business, and last but not least, planning and forecasting the business for future periods based on constant interactions with different stakeholders and teams within Typeform.",
    "type": "full",
    "responsibilities": [
        "Annual budget work along with reviewing processes of the Typeform group",
        "Monthly forecasting, with special focus on OPEX",
        "Monthly reporting of KPIs and performances of Typeform",
        "Support the different departments of the company in monitoring operations and spend",
        "Define, implement and monitor key controls and processes of Typeform"
    ],
    "minimum_requirements": [
        "6 years’ of experience in finance, preferably 2 of them in a controlling or FP&A department",
        "Ideally you have experience from a project based and service oriented position, where you dealt with a lot of different people by using you excellent communication skills. You are also used to keep up with tight deadlines",
        "Budget experience",
        "Experience from working in an international environment, preferably fast-paced start-up environment. Experience from a SaaS company is a big plus ",
        "Advanced skills in Excel",
        "Perfect written and spoken English & Spanish"
    ],
    "preferred_requirements": [],
    "compensation": "",
    "duration": ""
}